; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	thermograph2 - mode
	spectrograph4 - mode
	image5 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star8 - direction
	GroundStation13 - direction
	GroundStation2 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star12)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph4)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star8)
	(supports instrument2 image5)
	(supports instrument2 image1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
)
(:goal (and
	(have_image Planet14 image5)
	(have_image Phenomenon15 spectrograph4)
	(have_image Phenomenon15 spectrograph0)
	(have_image Planet16 image5)
	(have_image Star17 image1)
	(have_image Star17 infrared3)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (turn_to satellite0 star8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 groundstation13 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation13)
   goals met: 0 of 6
5. (turn_to satellite0 phenomenon15 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon15 instrument1 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon15 instrument1 spectrograph4)
   added: (have_image phenomenon15 spectrograph4)
   goals met: 2 of 6
8. (turn_to satellite0 groundstation13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 groundstation13)
   goals met: 2 of 6
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 6
10. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 6
11. (calibrate satellite0 instrument2 groundstation13)
   added: (calibrated instrument2)
   goals met: 2 of 6
12. (turn_to satellite0 planet14 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 planet14)
   goals met: 2 of 6
13. (take_image satellite0 planet14 instrument2 image5)
   added: (have_image planet14 image5)
   goals met: 3 of 6
14. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 3 of 6
15. (take_image satellite0 planet16 instrument2 image5)
   added: (have_image planet16 image5)
   goals met: 4 of 6
16. (turn_to satellite0 star17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star17)
   goals met: 4 of 6
17. (take_image satellite0 star17 instrument2 image1)
   added: (have_image star17 image1)
   goals met: 5 of 6
18. (take_image satellite0 star17 instrument2 infrared3)
   added: (have_image star17 infrared3)
   goals met: 6 of 6
